Parametres du reseau de neurones:

Episode max: 100001
Batch size: 64
Learning rate: 0.008
Epsilon decay: 0.999
Epsilon min: 0.01
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 10, 10, 32)        416       
                                                                 
 conv2d_1 (Conv2D)           (None, 9, 9, 128)         16512     
                                                                 
 conv2d_2 (Conv2D)           (None, 8, 8, 256)         131328    
                                                                 
 max_pooling2d (MaxPooling2D  (None, 4, 4, 256)        0         
 )                                                               
                                                                 
 conv2d_3 (Conv2D)           (None, 3, 3, 64)          65600     
                                                                 
 flatten (Flatten)           (None, 576)               0         
                                                                 
<<<<<<< HEAD
 dense (Dense)               (None, 64)                36928     
                                                                 
 dense_1 (Dense)             (None, 4)                 260       
=======
 dense_7 (Dense)             (None, 64)                36928     
                                                                 
 dense_8 (Dense)             (None, 4)                 260       
>>>>>>> 0c962bc424b0368befb7c78ec0723b946b73df81
                                                                 
=================================================================
Total params: 251,044
Trainable params: 251,044
Non-trainable params: 0
_________________________________________________________________
